---
kind: property
id: P:Autodesk.Revit.DB.HermiteFace.Points
source: html/7c29cedb-7e2d-7cca-8ffc-92dadcb7650d.htm
---
# Autodesk.Revit.DB.HermiteFace.Points Property

Interpolation points of the surface.

## Syntax (C#)
```csharp
public IList<XYZ> Points { get; }
```